DataProcessors/РаспределениеБюджета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<DataProcessor>
		<Properties>
			<Name>РаспределениеБюджета</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОбщийБюджет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТаблицаТовары</Name>
					<Type>
						<v8:Type>v8:ValueTable</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/РаспределениеБюджета/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПроверитьБюджет();
	Объект.ОбщаяСумма = 0;
	Для Каждого Строка Из Объект.ТаблицаТовары Цикл
		Объект.ОбщаяСумма = Объект.ОбщаяСумма + Строка.Сумма;
	КонецЦикла;
	
	Если Объект.ОбщаяСумма > Объект.ОбщийБюджет Тогда
		Элементы.НадписьПревышение.Видимость = Истина;               
	Иначе
		Элементы.НадписьПревышение.Видимость = Ложь;
	КонецЕсли;
КонецПРоцедуры
                                      

&НаКлиенте
Процедура ОбщийБюджетПриИзменении(Элемент)
	ПроверитьБюджет();
КонецПроцедуры


&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
		
	Строка = Элементы.Товары.ТекущиеДанные;
	Если Строка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Строка.Сумма = Строка.Цена * Строка.Количество;
	Элементы.Товары.Обновить();
	ПроверитьБюджет();
КонецПроцедуры        


&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
		
	Строка = Элементы.Товары.ТекущиеДанные;
	Если Строка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Строка.Сумма = Строка.Цена * Строка.Количество;
	Элементы.Товары.Обновить();
	ПроверитьБюджет();
КонецПроцедуры



&НаКлиенте
Процедура ТоварыСуммаПриИзменении(Элемент)
		
	Строка = Элементы.Товары.ТекущиеДанные;
	Если Строка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Строка.Количество = 0 Тогда
		Строка.Количество = 1;
	КонецЕсли;
	Строка.Цена = Строка.Сумма / Строка.Количество;
	Элементы.Товары.Обновить();
	ПроверитьБюджет();
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьБюджетКнопка(Команда)
	Объект.ОбщаяСумма = 0;
	Для Каждого Строка Из Объект.ТаблицаТовары Цикл
		Объект.ОбщаяСумма = Объект.ОбщаяСумма + Строка.Сумма;
	КонецЦикла;
	
	Если Объект.ОбщаяСумма > Объект.ОбщийБюджет Тогда
		СуммаПревышения = Объект.ОбщаяСумма - Объект.ОбщийБюджет;
        Предупреждение("Превышен бюджет на " + СуммаПревышения + " руб.");
	Иначе
		Предупреждение("Бюджет не превышен.");
	КонецЕсли;
КонецПроцедуры
